<?
$towns = [
    "Московская область" => ["Лотошино", "Павловский Посад", "Красногорск", "Краснознаменск"],
    "Ленинградская область" => ["Каменногорск", "Кировск", "Выборг", "Тосно"],
    "Свердловская область" => ["Екатеринбург", "Нижний Тагил", "Качканар", "Красноуфимск"],
    "Челябинская область" => ["Магнитогорск", "Коркино", "Озёрск", "Аша"],
    "Иркутская область" => ["Зима", "Ангарск", "Братск", "Киренск", "Киренск"]
];

foreach ($towns as $key => $region) {
    echo $key . ":\n";
    $str = "";
    foreach ($region as $town) {
        $str .= $town . ", ";

    }
    $str = mb_substr($str, 0, -2) . "\n";
    echo "$str \n";
}

echo "\n";